ezois_ka/oooezoiskaobmen/src/Catalogs/ДокументыРеализацииПолномочийНалоговыхОрганов/ДокументыРеализацииПолномочийНалоговыхОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыРеализацииПолномочийНалоговыхОрганов</name>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <comment>Вид налогового документа</comment>
    <type>
      <types>EnumRef.ВидыНалоговыхДокументов</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>182</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ПредметЦиклаОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРешенияНаЖалобу</name>
    <type>
      <types>EnumRef.ВидыРешенийНаЖалобу</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖалобы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЖалобы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РНПТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиНСП</name>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/CommonModules/ТребованияФНСКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПоказатьИнформациюоСроках(ВидДокумента = Неопределено, Выделять = Ложь) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидДокумента", ВидДокумента);
	ДополнительныеПараметры.Вставить("Выделять", Выделять);
	
	ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ФормаСрокиПредставления",ДополнительныеПараметры);
	
КонецПроцедуры
	
Процедура ИзменитьСрокТребования(ТребованиеСсылка, ОповещениеЗавершения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Требование", ТребованиеСсылка);
	ОткрытьФорму(
		"Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ИзменениеСрокаТребования", 
		ПараметрыФормы, 
		, 
		Истина,
		,
		,
		ОповещениеЗавершения);
		
	
КонецПроцедуры

Процедура ОткрытьКалендарь(СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Календарь = ТребованияФНСВызовСервера.ПроизводственныйКалендарь();
	ПоказатьЗначение(, Календарь);
	
КонецПроцедуры

Процедура ПодтвердитьПриемНескольких(Сейчас, КонтекстЭДОКлиент, Организация = Неопределено ) Экспорт
	
	Есть = ТребованияФНСВызовСервера.ЕстьТребующиеПодтверждения(Организация)
		ИЛИ ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЕстьТребующиеПодтвержденияТребованияСФР(
			Организация);
	
	Если Есть Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Сейчас", Сейчас);
		
		ОткрытьФорму(
			КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ГрупповоеПодтверждениеПриема",
			ПараметрыФормы,,,,,
			,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Текст = НСтр("ru = 'По организаци %1 отсутствуют требования, прием которых нужно подтвердить'");
			Текст = СтрШаблон(Текст, Организация);
		Иначе
			Текст = НСтр("ru = 'Отсутствуют требования, прием которых нужно подтвердить'");
		КонецЕсли;
		ПоказатьПредупреждение(, Текст);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьСканыВОтветНаТребование(КонтекстЭДОКлиент, УникальныйИдентификатор, ОповещениеЗавершения, МножественныйВыбор = Истина) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("КонтекстЭДОКлиент", КонтекстЭДОКлиент);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыбратьСканыВОтветНаТребование_ПослеВыбора", 
		ЭтотОбъект,
		ДополнительныеПараметры);
		
	ПараметрыДобавления = ТребованияФНСКлиентСервер.ПараметрыВыбораФайловВОтветНаТребованиеДокументов(МножественныйВыбор);
	ОперацииСФайламиЭДКОКлиент.ДобавитьФайлы(
		ОписаниеОповещения, 
		УникальныйИдентификатор,
		,
		ПараметрыДобавления);
	
КонецПроцедуры

Процедура ДобавитьСканыВОтветНаТребованиеПоОписаниюФайлов(
		КонтекстЭДОКлиент, 
		УникальныйИдентификатор, 
		ОписаниеФайлов, 
		ОповещениеЗавершения) Экспорт
		
	Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
		ОписаниеФайла.Имя = ПроверитьИмяФайлаНаСимволы(КонтекстЭДОКлиент, ОписаниеФайла.Имя);
	КонецЦикла;
	
	ОбработкаФайловPDFВызовСервера.ОпределитьСвойстваPDFФайлов(ОписаниеФайлов);
	
	ОчиститьСообщения();
	ФайлыКОбработке = Новый Массив;
	Для каждого ОписаниеФайла Из ОписаниеФайлов Цикл
		
		Если ОписаниеФайла.ЭтоPDFa3 
			И ТребованияФНСКлиентСервер.ЭтоФормат_ON_DOCNPNO_1_886_00_05_02() Тогда
			СообщитьОНедопустимостиЗагрузкиPDFA3ВСканы(ОписаниеФайла.Имя);
		Иначе
			ФайлыКОбработке.Добавить(ОписаниеФайла);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ФайлыКОбработке.Количество() = 0 Тогда
		НеВыполнено = ДокументооборотСКОКлиентСервер.НеВыполнено();
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, НеВыполнено);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("КонтекстЭДОКлиент", КонтекстЭДОКлиент);
	ДополнительныеПараметры.Вставить("ФайлыДоОбработки", ФайлыКОбработке);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыбратьСканыВОтветНаТребование_ПослеОбработкиКартинок", 
		ЭтотОбъект,
		ДополнительныеПараметры);
		
	Требования = ТребованияФНСКлиентСервер.ТребованияКИзображениямОтветаНаТребованиеДокументов();
	
	ОперацииСФайламиЭДКОСлужебныйКлиент.ОбработатьКартинки(
		ОписаниеОповещения, 
		ФайлыКОбработке, 
		Требования, 
		УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ОткрытьФормуПодтвержденияВыбораОбязательностиЭДО(Обязателен, Ссылка, Организация, ОповещениеЗавершения = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения);
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	Параметры.Вставить("Обязателен", Обязателен);
	Параметры.Вставить("Организация", Организация);
	Параметры.Вставить("Ссылка", Ссылка);

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Обязателен", Обязателен);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("Ссылка", Ссылка);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеПодтвержденияВыбораОбязательностиЭДО", 
		ЭтотОбъект, 
		ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ПодтверждениеВыбораОбязательностиЭДО",Параметры,,,,,ОписаниеОповещения);
	
КонецПроцедуры

Процедура ПослеПодтвержденияВыбораОбязательностиЭДО(Результат, ВходящийКонтекст = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТребованияФНСВызовСервера.СохранитьРезультатВыбораЭДОДляСсылкиИОрганизации(Результат);
	
	Массив = ТребованияФНСВызовСервера.ТребованияУведомленияПоСсылке(Результат.Ссылка);
	ОповеститьЧтоИзменилосьТребованиеУведомление(Массив);
	
	Если ВходящийКонтекст <> Неопределено И ВходящийКонтекст.Свойство("ОповещениеЗавершения") Тогда
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьРезультатВыбораЭДОДляСсылки(Ссылка, Обязателен) Экспорт
	
	Массив = ТребованияФНСВызовСервера.ТребованияУведомленияПоСсылке(Ссылка);

	ТребованияФНСВызовСервера.СохранитьРезультатВыбораЭДОДляСсылок(Массив, Обязателен);
	
	ОповеститьЧтоИзменилосьТребованиеУведомление(Массив);
	
КонецПроцедуры

Процедура СпроситьПроОбязательностьЭДО(
		Организация, 
		ОписаниеОповещения = Неопределено, 
		ДоступнаГалкаЗапомнить = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура("Организация, ДоступнаГалкаЗапомнить", Организация, ДоступнаГалкаЗапомнить);
	
	ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ВопросПроОбязательностьЭДО", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыбратьСканыВОтветНаТребование_ПослеВыбора(Результат, ВходящийКонтекст) Экспорт
	
	Если НЕ Результат.Выполнено Тогда
		НеВыполнено = ДокументооборотСКОКлиентСервер.НеВыполнено();
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеЗавершения, НеВыполнено);
		Возврат;
	КонецЕсли;
	
	ОписаниеФайлов = Результат.ОписанияФайлов;
	
	ДобавитьСканыВОтветНаТребованиеПоОписаниюФайлов(
		ВходящийКонтекст.КонтекстЭДОКлиент, 
		ВходящийКонтекст.УникальныйИдентификатор, 
		ОписаниеФайлов, 
		ВходящийКонтекст.ОповещениеЗавершения);
	
КонецПроцедуры
	
Функция ПроверитьИмяФайлаНаСимволы(КонтекстЭДОКлиент, ТекущееИмяФайла) Экспорт
	
	ИзмененоИмя = Ложь;
	НовоеИмя = ТекущееИмяФайла;
	
	РезультатПроверки = КонтекстЭДОКлиент.ПроверитьНеДопустимыеСимволыИмениФайла(ТекущееИмяФайла, "windows-1251");
	Если НЕ РезультатПроверки.Пройдена Тогда
		НовоеИмя = РезультатПроверки.НовоеИмя;
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'В имени файла недопустимые символы.'"), , 
			НСтр("ru = 'Произведена замена недопустимых символов.'"), , 
			СтатусОповещенияПользователя.Информация);
	КонецЕсли;
	
Возврат НовоеИмя;
	
КонецФункции

Процедура ВыбратьСканыВОтветНаТребование_ПослеОбработкиКартинок(Результат, ВходящийКонтекст) Экспорт
	
	Если НЕ Результат.Выполнено Тогда
		НеВыполнено = ДокументооборотСКОКлиентСервер.НеВыполнено();
		ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеЗавершения, НеВыполнено);
		Возврат;
	КонецЕсли;
	
	ТребованияФНСВызовСервера.ВосстановитьСвойстваФайлов(Результат.ОписанияФайлов, ВходящийКонтекст.ФайлыДоОбработки);
	
	ВыполнитьОбработкуОповещения(ВходящийКонтекст.ОповещениеЗавершения, Результат);
	
КонецПроцедуры

Процедура СообщитьОНедопустимостиЗагрузкиPDFA3ВСканы(Имя) Экспорт
	
	Ошибка = НСтр("ru = 'Файл ""%1"" имеет формат PDF/A-3 и, в соответствии с Приказом ФНС от 19 апреля 2023 г. №ЕД-7-26/263@, не может быть загружен и отправлен как сканированный документ.
                   |Для загрузки файла как сканированного документа сконвертируйте его в другой формат, например, сторонними программами. Разрешенные форматы: TIF, JPG, PNG, PDF (но не PDF/A-3).
                   |Если вы загружаете документы 1С-ЭДО, в форме ответа воспользуйтесь одним из пунктов:
                   |1. Если документы хранятся в текущей базе, то ""Выбрать из базы"" - ""Электронные документы 1С-ЭДО, 1С-Такском"".
                   |2. Если документы хранятся в другой базе, то ""Загрузить с диска"" - ""Документы из другой базы"". Предварительно выгрузите их из архива 1С-ЭДО другой базы по инструкции https://its.1c.ru/bmk/clientedodoc2/exp2fns.'");
	
	Ошибка = СтрШаблон(Ошибка, Имя);
	ДлительнаяОтправкаКлиентСервер.ВывестиОшибку(Ошибка);
	
КонецПроцедуры

// Используется при вставке 1. значений в пояснение и 2. параметров в шаблон пояснения
Процедура ВставитьПараметр(Форма, Имя, Знач Значение) Экспорт
	
	ЭлементФормы  = Форма.Элементы[Имя];
	РеквизитФормы = Форма[Имя];
	
	ЗакладкаНачала = Неопределено;
	ЗакладкаОкончания = Неопределено;
	ЭлементФормы.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);

	ПозицияНачала    = РеквизитФормы.ПолучитьПозициюПоЗакладке(ЗакладкаНачала);
	ПозицияОкончания = РеквизитФормы.ПолучитьПозициюПоЗакладке(ЗакладкаОкончания);
	
	УдалитьВыделенныйЭлементДокумента(Форма, Имя, ЗакладкаНачала, ЗакладкаОкончания);
	Текст = СоздатьНовыйЭлементДокумента(РеквизитФормы, ЗакладкаНачала, Значение);
	
	ПозицияОкончания  = ПозицияНачала + СтрДлина(Текст);
	ЗакладкаОкончания = РеквизитФормы.ПолучитьЗакладкуПоПозиции(ПозицияОкончания);
	ЭлементФормы.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура УдалитьВыделенныйЭлементДокумента(Форма, Имя, ЗакладкаНачала, ЗакладкаОкончания) Экспорт
	
	ЭлементФормы  = Форма.Элементы[Имя];
	РеквизитФормы = Форма[Имя];
	
	Если ЗакладкаНачала <> ЗакладкаОкончания Тогда 
		РеквизитФормы.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
		ЭлементФормы.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеВставляемогоПараметра(Значение)
	
	Результат = Новый Структура();
	Результат.Вставить("Текст", "");
	Результат.Вставить("ЦветФона", Новый Цвет);
	
	Если ЗначениеЗаполнено(Значение.Значение) Тогда
		Результат.Текст = Значение.Значение;
		Результат.ЦветФона = Значение.ЦветФонаЗначения;
	ИначеЕсли ЗначениеЗаполнено(Значение.Замена) Тогда
		Результат.Текст = Значение.Замена;
		Результат.ЦветФона = Значение.ЦветФонаЗамены;
	Иначе
		// Обход ошибки платформы 60010487
		// 60010487 ФорматированныйДокумент.Вставить вернул Неопределено
		Результат.Текст = ТребованияФНСКлиентСервер.Подчерк();
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция СоздатьНовыйЭлементДокумента(РеквизитФормы, ЗакладкаНачала, Значение) Экспорт
	
	Результат   = ЗначениеВставляемогоПараметра(Значение);
	ТипЭлемента = Тип("ТекстФорматированногоДокумента");
	
	Если РеквизитФормы.Элементы.Количество() = 0 Тогда
		НовыйЭлементДокумента = РеквизитФормы.Добавить(Результат.Текст, ТипЭлемента);
	Иначе
		НовыйЭлементДокумента = РеквизитФормы.Вставить(ЗакладкаНачала, Результат.Текст, ТипЭлемента);
	КонецЕсли;
	
	НовыйЭлементДокумента.Шрифт = Новый Шрифт(НовыйЭлементДокумента.Шрифт, , , Истина, , );
	НовыйЭлементДокумента.ЦветФона = ТребованияФНСКлиентСервер.Оранжевый();
	
	Возврат Результат.Текст;
	
КонецФункции

Процедура ПересчитатьИтог(Форма, Таблица, ИмяКолонки, ИмяПоляИтога) Экспорт
	
	Итог = 0;
	Для каждого Строка Из Таблица Цикл
		Итог = Итог + Строка[ИмяКолонки];
	КонецЦикла;
	
	Форма[ИмяПоляИтога] = Итог;

КонецПроцедуры

Процедура ВставитьПериод(ОповещениеЗавершения) Экспорт
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = ТекущаяДата();
	Диалог.Период.ДатаОкончания = ТекущаяДата();
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВставитьПериод_Завершение", 
		ЭтотОбъект, 
		ОповещениеЗавершения);
		
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

Процедура ВставитьПериод_Завершение(Период, ОповещениеЗавершения) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ФинансовыйПериод = РегламентированнаяОтчетностьВызовСервера.ПредставлениеФинансовогоПериода(
		Период.ДатаНачала, 
		Период.ДатаОкончания);
		
	ФинансовыйПериод = НРег(ФинансовыйПериод);
	
	ВыполнитьОбработкуОповещения(ОповещениеЗавершения, ФинансовыйПериод);
	
КонецПроцедуры

Процедура ВыбратьИзСправочника(Форма, Элемент) Экспорт
	
	ИмяФормы  = ДлительнаяОтправкаКлиентСервер.ИмяФормыПоПолномуИмени(Форма.ИмяФормы);
	ИмяМакета = ИмяФормы + "_" + Элемент.Родитель.Имя;
	
	ВыбратьИзСправочникаПоМакету(Элемент, ИмяМакета);
		
КонецПроцедуры
	
Процедура ВыбратьИзСправочникаПоМакету(Элемент, ИмяМакета) Экспорт
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяПоля", Элемент.Имя);
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыбратьИзСправочника_ПослеВыбора", 
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяМакета", ИмяМакета);
	
	ОткрытьФорму(
		"Справочник.ШаблоныПоясненийДляФНС.Форма.ВыборИзСправочника",
		ПараметрыФормы,
		,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
Процедура ВыбратьИзСправочника_ПослеВыбора(Результат, ВходящийКонтекст) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ВходящийКонтекст.ТекущиеДанные[ВходящийКонтекст.ИмяПоля] = Результат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДеревоПометкаПриИзменении(ЭлементДерево) Экспорт
	
	СтрокаДерева = ЭлементДерево.ТекущиеДанные;
	
	ТребованияФНСКлиентСервер.ДеревоПометкаПриИзмененииПоСтроке(СтрокаДерева);
	
КонецПроцедуры

Процедура ОткрытьТестНаОбязательностьЭДО(
		Организация, 
		ОповещениеЗавершения, 
		ПредлагатьЗапомнитьПоОрганизации,
		ВходящийКонтекст = Неопределено) Экспорт

	Если ВходящийКонтекст = Неопределено Тогда
		ВходящийКонтекст = Новый Структура();
	КонецЕсли;
		
	ВходящийКонтекст.Вставить("Организация", Организация);
	ВходящийКонтекст.Вставить("ПредлагатьЗапомнитьПоОрганизации", ПредлагатьЗапомнитьПоОрганизации);

	ОткрытьФорму(
		"Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ТестНаОбязательностьЭДО",
		ВходящийКонтекст,
		,
		,
		,
		,
		ОповещениеЗавершения);
		
КонецПроцедуры

Процедура ОповеститьЧтоИзменилосьТребованиеУведомление(Массив) Экспорт
	
	Для каждого ТребованиеУведомление Из Массив Цикл
		Оповестить("Запись_ДокументыРеализацииПолномочийНалоговыхОрганов",,ТребованиеУведомление);
	КонецЦикла;
	
КонецПроцедуры

Функция СохранитьРезультатВыбораЭДОПоОрганизации(Организация, Обязателен) Экспорт
	
	Массив = ТребованияФНСВызовСервера.СохранитьРезультатВыбораЭДОПоОрганизации(Организация, Обязателен);
	ОповеститьЧтоИзменилосьТребованиеУведомление(Массив);
	
КонецФункции

Процедура ПриКликеНаСсылкуВПанелиОтправки(Форма, Организация, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
	Если НавигационнаяСсылка = "ИзменитьНастройкиПодтверждения" Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеПодтвержденияЧтоЭДООбязателен", 
			Форма); 
			
		ТребованияФНСКлиент.СпроситьПроОбязательностьЭДО(
			Организация, 
			ОписаниеОповещения);
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
